## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 3 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.perf_test_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "perf_test_container_definition"  {
      ~ id       = "2436a46f55941f120fdb214bb07c0792555878d823d176e5e1d8d7c0c88949b3" -> (known after apply)
      ~ rendered = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - name             = "performance-tests-container"
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "perf_test_event_rule-terraform-20211129205416437200000001"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ tags                    = {
              + "CostCenter" = "notification-canada-ca-staging"
            }
          ~ task_definition_arn     = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:2" -> (known after apply)
            # (6 unchanged attributes hidden)

          ~ network_configuration {
              ~ assign_public_ip = false -> true
                # (2 unchanged attributes hidden)
            }
        }
    }

  # aws_ecs_cluster.perf_test will be updated in-place
  ~ resource "aws_ecs_cluster" "perf_test" {
        id                 = "arn:aws:ecs:ca-central-1:239043911459:cluster/performance_test_cluster"
        name               = "performance_test_cluster"
      ~ tags               = {
          + "CostCenter" = "notification-canada-ca-staging"
          - "CostCentre" = "notification-canada-ca-staging" -> null
        }
      ~ tags_all           = {
          + "CostCenter" = "notification-canada-ca-staging"
          - "CostCentre" = "notification-canada-ca-staging" -> null
        }
        # (2 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.perf_test_task must be replaced
-/+ resource "aws_ecs_task_definition" "perf_test_task" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:239043911459:task-definition/performance_test_cluster:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "PERF_TEST_AWS_S3_BUCKET"
                          - value = "notify-performance-test-results-staging"
                        },
                      - {
                          - name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          - value = "/tmp/notify_performance_test"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          - value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      - {
                          - name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          - value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                      - {
                          - name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          - value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                    ]
                  - essential        = true
                  - image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "performance_test_cluster"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  - mountPoints      = []
                  - name             = "performance-tests-container"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "PERF_TEST_PHONE_NUMBER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_phone_number-DWkOGY"
                        },
                      - {
                          - name      = "PERF_TEST_EMAIL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_email-sWnA9Z"
                        },
                      - {
                          - name      = "PERF_TEST_DOMAIN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_domain-WSUpwW"
                        },
                      - {
                          - name      = "PERF_TEST_AUTH_HEADER"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:239043911459:secret:perf_test_auth_header-PxFUOL"
                        },
                    ]
                  - ulimits          = [
                      - {
                          - hardLimit = 98304
                          - name      = "nofile"
                          - softLimit = 98304
                        },
                    ]
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "performance_test_cluster" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      ~ tags                     = {
          + "CostCenter" = "notification-canada-ca-staging"
          - "CostCentre" = "notification-canada-ca-staging" -> null
        }
      ~ tags_all                 = {
          + "CostCenter" = "notification-canada-ca-staging"
          - "CostCentre" = "notification-canada-ca-staging" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # aws_iam_role.perf_test_ecs_task will be updated in-place
  ~ resource "aws_iam_role" "perf_test_ecs_task" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRole" -> [
                          + "sts:AssumeRole",
                          + "iam:PassRole",
                        ]
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "performance_test_cluster-ecs-task"
        name                  = "performance_test_cluster-ecs-task"
      ~ tags                  = {
          + "CostCenter" = "notification-canada-ca-staging"
          - "CostCentre" = "notification-canada-ca-staging" -> null
        }
      ~ tags_all              = {
          + "CostCenter" = "notification-canada-ca-staging"
          - "CostCentre" = "notification-canada-ca-staging" -> null
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>